<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"2c661e80d78e80875d2e3db813d3f5af7fe1e69a6873f3c78c6138e96c58b55e","plan_job_ref":"Job Terraform plan #49 at https://github.com/fvst-dev/fvst-monorepo/actions/runs/5882425697","plan_hash":"ba7996fb855caecbd37c43e01b0f5f9760336ae820195795e6e76a3c99742018","plan_text_format":"text","version":"1.36.1"} -->
Terraform plan in __./infra/envs/production__
<details>
<summary>Plan: 7 to add, 0 to change, 1 to destroy.</summary>

```hcl
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.web.google_project_iam_member.secret_manager_binding will be created
  + resource "google_project_iam_member" "secret_manager_binding" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + member  = (known after apply)
      + project = "kolm-kod-1-fvst-production"
      + role    = "roles/secretmanager.secretAccessor"
    }

  # module.web.google_service_account.service_account will be created
  + resource "google_service_account" "service_account" {
      + account_id  = "******"
      + description = "web SA"
      + disabled    = false
      + email       = (known after apply)
      + id          = (known after apply)
      + member      = (known after apply)
      + name        = (known after apply)
      + project     = (known after apply)
      + unique_id   = (known after apply)
    }

  # module.web.null_resource.iam_depends_on will be created
  + resource "null_resource" "iam_depends_on" {
      + id = (known after apply)
    }

  # module.graphql-gateway.module.service.google_cloud_run_service.default is tainted, so must be replaced
-/+ resource "google_cloud_run_service" "default" {
      ~ id                         = "*************************************************************************************" -> (known after apply)
        name                       = "graphql-gateway"
      ~ project                    = "kolm-kod-1-fvst-production" -> (known after apply)
      ~ status                     = [
          - {
              - conditions                   = [
                  - {
                      - message = <<-EOT
                            Revision 'graphql-gateway-00001-5vf' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=kolm-kod-1-fvst-production&resource=cloud_run_revision/service_name/graphql-gateway/revision_name/graphql-gateway-00001-5vf&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22graphql-gateway%22%0Aresource.labels.revision_name%3D%22graphql-gateway-00001-5vf%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "Ready"
                    },
                  - {
                      - message = ""
                      - reason  = ""
                      - status  = "True"
                      - type    = "ConfigurationsReady"
                    },
                  - {
                      - message = <<-EOT
                            Revision 'graphql-gateway-00001-5vf' is not ready and cannot serve traffic. The user-provided container failed to start and listen on the port defined provided by the PORT=8080 environment variable. Logs for this revision might contain more information.
                            
                            Logs URL: https://console.cloud.google.com/logs/viewer?project=kolm-kod-1-fvst-production&resource=cloud_run_revision/service_name/graphql-gateway/revision_name/graphql-gateway-00001-5vf&advancedFilter=resource.type%3D%22cloud_run_revision%22%0Aresource.labels.service_name%3D%22graphql-gateway%22%0Aresource.labels.revision_name%3D%22graphql-gateway-00001-5vf%22 
                            For more troubleshooting guidance, see https://cloud.google.com/run/docs/troubleshooting#container-failed-to-start
                        EOT
                      - reason  = "HealthCheckContainerError"
                      - status  = "False"
                      - type    = "RoutesReady"
                    },
                ]
              - latest_created_revision_name = "graphql-gateway-00001-5vf"
              - latest_ready_revision_name   = ""
              - observed_generation          = 1
              - traffic                      = [
                  - {
                      - latest_revision = true
                      - percent         = 100
                      - revision_name   = "graphql-gateway-00001-5vf"
                      - tag             = ""
                      - url             = ""
                    },
                ]
              - url                          = ""
            },
        ] -> (known after apply)
        # (2 unchanged attributes hidden)

      - metadata {
          - annotations      = {
              - "run.googleapis.com/ingress"        = "all"
              - "run.googleapis.com/ingress-status" = "all"
              - "run.googleapis.com/operation-id"   = "************************************"
              - "serving.knative.dev/creator"       = "github-actions@kolm-kod-1-fvst-production.iam.gserviceaccount.com"
              - "serving.knative.dev/lastModifier"  = "github-actions@kolm-kod-1-fvst-production.iam.gserviceaccount.com"
            } -> null
          - generation       = 1 -> null
          - labels           = {
              - "cloud.googleapis.com/location" = "europe-west1"
            } -> null
          - namespace        = "kolm-kod-1-fvst-production" -> null
          - resource_version = "AAYDCHMGjlc" -> null
          - self_link        = "/apis/serving.knative.dev/v1/namespaces/693229986735/services/graphql-gateway" -> null
          - uid              = "b80e46d6-9260-4464-ae0f-4885f02bd6e7" -> null
        }

      ~ template {
          ~ metadata {
              ~ annotations      = {
                  - "autoscaling.knative.dev/maxScale"         = "100" -> null
                    # (1 unchanged element hidden)
                }
              ~ generation       = 0 -> (known after apply)
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
                # (1 unchanged attribute hidden)
            }
          ~ spec {
              ~ container_concurrency = 80 -> (known after apply)
              + serving_state         = (known after apply)
              ~ timeout_seconds       = 300 -> (known after apply)
                # (1 unchanged attribute hidden)

              ~ containers {
                  - args    = [] -> null
                  - command = [] -> null
                  + name    = (known after apply)
                    # (1 unchanged attribute hidden)

                  - ports {
                      - container_port = 8080 -> null
                      - name           = "http1" -> null
                    }

                  ~ resources {
                      - requests = {} -> null
                        # (1 unchanged attribute hidden)
                    }

                  - startup_probe {
                      - failure_threshold     = 1 -> null
                      - initial_delay_seconds = 0 -> null
                      - period_seconds        = 240 -> null
                      - timeout_seconds       = 240 -> null

                      - tcp_socket {
                          - port = 8080 -> null
                        }
                    }

                    # (4 unchanged blocks hidden)
                }
            }
        }

      ~ traffic {
          + url             = (known after apply)
            # (2 unchanged attributes hidden)
        }
    }

  # module.graphql-gateway.module.service.google_cloud_run_service_iam_member.public_access[0] will be created
  + resource "google_cloud_run_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "graphql-gateway"
    }

  # module.web.module.service.google_cloud_run_service.default will be created
  + resource "google_cloud_run_service" "default" {
      + autogenerate_revision_name = false
      + id                         = (known after apply)
      + location                   = "europe-west1"
      + name                       = "web"
      + project                    = (known after apply)
      + status                     = (known after apply)

      + template {
          + metadata {
              + annotations      = {
                  + "run.googleapis.com/execution-environment" = "gen2"
                }
              + generation       = (known after apply)
              + labels           = {
                  + "run.googleapis.com/startupProbeType" = "Default"
                }
              + name             = (known after apply)
              + namespace        = (known after apply)
              + resource_version = (known after apply)
              + self_link        = (known after apply)
              + uid              = (known after apply)
            }
          + spec {
              + container_concurrency = (known after apply)
              + service_account_name  = (known after apply)
              + serving_state         = (known after apply)
              + timeout_seconds       = (known after apply)

              + containers {
                  + image = "us-docker.pkg.dev/kolm-kod-1-fvst-production/registry/web:latest"
                  + name  = (known after apply)

                  + resources {
                      + limits = {
                          + "cpu"    = "1000m"
                          + "memory" = "512Mi"
                        }
                    }
                }
            }
        }

      + traffic {
          + latest_revision = true
          + percent         = 100
          + url             = (known after apply)
        }
    }

  # module.web.module.service.google_cloud_run_service_iam_member.public_access[0] will be created
  + resource "google_cloud_run_service_iam_member" "public_access" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = (known after apply)
      + role     = "roles/run.invoker"
      + service  = "web"
    }

Plan: 7 to add, 0 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Terraform plan #49](https://github.com/fvst-dev/fvst-monorepo/actions/runs/5882425697)